In [38]:
import numpy as np
import pandas as pd

pd.options.display.float_format = '{:,.0f}'.format

In [10]:
letters = np.array(['A','B', 'C', 'D'])

letters_series = pd.Series(letters)

letters_series

0    A
1    B
2    C
3    D
dtype: object

In [16]:
median_income = {
    'Arlingtion': 94880,
    'Falls Church': 114409,
    'Alexandria': 80847,
    'Fairfax': 105416,
    'Prince William': 91098,
    'Augusta': 50612,
    'Amherst': 44757,
    'Botetourt': 64724,
    'Bedford': 54110,
    'Adnan': 50000
}

median_income_series = pd.Series(median_income)

median_income_series

Arlingtion         94880
Falls Church      114409
Alexandria         80847
Fairfax           105416
Prince William     91098
Augusta            50612
Amherst            44757
Botetourt          64724
Bedford            54110
Adnan              50000
dtype: int64

In [17]:
households = {
    'Arlingtion': 98050,
    'Falls Church': 5101,
    'Alexandria': 68082,
    'Fairfax': 391627,
    'Prince William': 130785,
    'Augusta': 28516,
    'Amherst': 12560,
    'Botetourt': 13126,
    'Bedford': 27465,
}

households_series = pd.Series(households)

households_series

Arlingtion         98050
Falls Church        5101
Alexandria         68082
Fairfax           391627
Prince William    130785
Augusta            28516
Amherst            12560
Botetourt          13126
Bedford            27465
dtype: int64

In [18]:
counties = pd.DataFrame({
    'median_income': median_income_series,
    'households': households_series
})

counties.head(10)

                median_income  households
Adnan                   50000         NaN
Alexandria              80847     68082.0
Amherst                 44757     12560.0
Arlingtion              94880     98050.0
Augusta                 50612     28516.0
Bedford                 54110     27465.0
Botetourt               64724     13126.0
Fairfax                105416    391627.0
Falls Church           114409      5101.0
Prince William          91098    130785.0

In [28]:
counties.columns = ['Households', 'Medain Income']
counties.index.name = 'County'

counties.head()

            Households  Medain Income
County
Adnan            50000            NaN
Alexandria       80847        68082.0
Amherst          44757        12560.0
Arlingtion       94880        98050.0
Augusta          50612        28516.0

In [22]:
counties.to_csv('data\counties.csv')

In [25]:
counties_csv = pd.read_csv('data\counties.csv')
counties_csv.head(10)

           County  Households  Medain Income
0           Adnan       50000            NaN
1      Alexandria       80847        68082.0
2         Amherst       44757        12560.0
3      Arlingtion       94880        98050.0
4         Augusta       50612        28516.0
5         Bedford       54110        27465.0
6       Botetourt       64724        13126.0
7         Fairfax      105416       391627.0
8    Falls Church      114409         5101.0
9  Prince William       91098       130785.0

In [42]:
counties['Total Household Income'] = counties['Households'] * counties['Medain Income']

#counties.dtypes

counties.head(10)

print("Households Mean: {:.2f}".format(counties['Households'].mean()))
print("Household Median Income: {:.2f}".format(counties['Medain Income'].mean()))
counties["Households"].describe()

Households Mean: 75085.30
Household Median Income: 86145.78

count        10
mean     75,085
std      25,480
min      44,757
25%      51,486
50%      72,786
75%      93,934
max     114,409
Name: Households, dtype: float64

In [52]:
counties.query('Households > 100000').head(10)

              Households  Medain Income  Total Household Income
County
Fairfax           105416        391,627          41,283,751,832
Falls Church      114409          5,101             583,600,309

In [53]:
counties[counties['Households'] > 100000].head(10)

              Households  Medain Income  Total Household Income
County
Fairfax           105416        391,627          41,283,751,832
Falls Church      114409          5,101             583,600,309

In [54]:
high_household_counties = counties['Households'] > 100000
counties[high_household_counties]

              Households  Medain Income  Total Household Income
County
Fairfax           105416        391,627          41,283,751,832
Falls Church      114409          5,101             583,600,309

In [58]:
high_median_income = counties['Medain Income'] > 75000
counties[high_median_income | high_household_counties]

                Households  Medain Income  Total Household Income
County
Arlingtion           94880         98,050           9,302,984,000
Fairfax             105416        391,627          41,283,751,832
Falls Church        114409          5,101             583,600,309
Prince William       91098        130,785          11,914,251,930

In [59]:
counties_csv[0:4]

       County  Households  Medain Income
0       Adnan       50000            nan
1  Alexandria       80847         68,082
2     Amherst       44757         12,560
3  Arlingtion       94880         98,050

In [60]:
counties_csv[['Households','Medain Income']].head(10)

   Households  Medain Income
0       50000            nan
1       80847         68,082
2       44757         12,560
3       94880         98,050
4       50612         28,516
5       54110         27,465
6       64724         13,126
7      105416        391,627
8      114409          5,101
9       91098        130,785

In [62]:
counties_csv[['Households','Medain Income']][1:3]

   Households  Medain Income
1       80847         68,082
2       44757         12,560

In [63]:
counties_csv[['Households','Medain Income']][counties_csv['Medain Income'] > 75000]

   Households  Medain Income
3       94880         98,050
7      105416        391,627
9       91098        130,785

In [71]:
counties_csv2 = counties_csv[['Households','Medain Income']][counties_csv['Medain Income'] > 75000]

counties_csv2['Divide by 50'] = counties_csv2['Medain Income'] / 50 

counties_csv2.sort_values(by =['Medain Income'], ascending = False)
#counties_csv2.sort_values(by =['Medain Income'], ascending = False)[['Households','Medain Income']].head(10)

   Households  Medain Income  Divide by 50
7      105416        391,627         7,833
9       91098        130,785         2,616
3       94880         98,050         1,961

In [72]:
counties_csv[counties_csv['Medain Income'] > 0]['Medain Income'].mean()

86145.77777777778